In [2]:
import pandas as pd
import numpy as np

In [5]:
d = {'Company':['Google','Google','FB','FB','Yahoo','Yahoo'],
     'Persons':['Charlie','Sam','Ram','Afzal','Vihan','Shiv'],
     'Sales':[100,200,300,400,500,600]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

  Company  Persons  Sales
0  Google  Charlie    100
1  Google      Sam    200
2      FB      Ram    300
3      FB    Afzal    400
4   Yahoo    Vihan    500
5   Yahoo     Shiv    600

In [9]:
df.groupby('Company')

In [10]:
r = df.groupby('Company')

In [11]:
#It automatically ignores string values 
r.mean()

         Sales
Company
FB         350
Google     150
Yahoo      550

In [17]:
#All operations in one line 
df.groupby('Company').sum().loc['FB']

Sales    700
Name: FB, dtype: int64

In [25]:
#Detaild view , describe will be used the most in Data science field
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Google    2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
Yahoo     2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0